# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 5  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv_maxpool, [24]]    # 0-P2/4

  - [-1, 1, ShuffleNetV2_InvertedResidual, [116, 2]] # 1-P3/8
  - [-1, 3, ShuffleNetV2_InvertedResidual, [116, 1]] # 2

  - [-1, 1, ShuffleNetV2_InvertedResidual, [232, 2]] # 3-P4/16
  - [-1, 7, ShuffleNetV2_InvertedResidual, [232, 1]] # 4

  - [-1, 1, ShuffleNetV2_InvertedResidual, [464, 2]] # 5-P5/32
  - [-1, 3, ShuffleNetV2_InvertedResidual, [464, 1]] # 6

  - [-1, 1, SPPF, [1024, 5]]  # 7


# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 13 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 16 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 19 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]]  # Detect(P3, P4, P5)
