# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 5  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, conv_bn_hswish, [16, 2 ]]                 # 0-p1/2

  - [-1, 1, MobileNet_Block, [16,  16, 3, 2, 1, 0]]  # 1-p2/4

  - [-1, 1, MobileNet_Block, [24,  72, 3, 2, 0, 0]]  # 2-p3/8
  - [-1, 1, MobileNet_Block, [24,  88, 3, 1, 0, 0]]  # 3-p3/8

  - [-1, 1, MobileNet_Block, [40,  96, 5, 2, 1, 1]]  # 4-p4/16
  - [-1, 1, MobileNet_Block, [40, 240, 5, 1, 1, 1]]  # 5-p4/16
  - [-1, 1, MobileNet_Block, [40, 240, 5, 1, 1, 1]]  # 6-p4/16
  - [-1, 1, MobileNet_Block, [48, 120, 5, 1, 1, 1]]  # 7-p4/16
  - [-1, 1, MobileNet_Block, [48, 144, 5, 1, 1, 1]]  # 8-p4/16

  - [-1, 1, MobileNet_Block, [96, 288, 5, 2, 1, 1]]  # 9-p5/32
  - [-1, 1, MobileNet_Block, [96, 576, 5, 1, 1, 1]]  # 10-p5/32
  - [-1, 1, MobileNet_Block, [96, 576, 5, 1, 1, 1]]  # 11-p5/32
  - [-1, 1, SPPF, [1024, 5]]  # 12

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)
